RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsi.c
/**
  ******************************************************************************
  * @file    bl808_dsi.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl808_dsi.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  DSI
 *  @{
 */

/** @defgroup  DSI_Private_Macros
 *  @{
 */
#define DSI_TX_TIMEOUT_COUNT (320 * 1000)

/*@} end of group DSI_Private_Macros */

/** @defgroup  DSI_Private_Types
 *  @{
 */

/*@} end of group DSI_Private_Types */

/** @defgroup  DSI_Private_Variables
 *  @{
 */

static const uint32_t dsiAddr[DSI_ID_MAX] = { DSI_BASE };

/**
 *  @brief DSI interrupt callback function address array
*/
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *DSIIntCbfArra[DSI_ID_MAX][DSI_INT_COUNT] = {
    { NULL, NULL, NULL }
};
#endif
/*@} end of group DSI_Private_Variables */

/** @defgroup  DSI_Global_Variables
 *  @{
 */

/*@} end of group DSI_Global_Variables */

/** @defgroup  DSI_Private_Fun_Declaration
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static BL_Err_Type DSI_IntHandler(DSI_ID_Type dsiId);
#endif

/*@} end of group DSI_Private_Fun_Declaration */

/** @defgroup  DSI_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  DSI interrupt handle
 *
 * @param  None
 *
 * @return SUCCESS
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static BL_Err_Type DSI_IntHandler(DSI_ID_Type dsiId)
{
    uint32_t maskVal;
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(dsiId));

    maskVal = BL_RD_REG(DSIx, DSI_INT_MASK);
    tmpVal = BL_RD_REG(DSIx, DSI_INT_STATUS);

    if (tmpVal & DSI_INT_ESCAPE_TX_END && !(maskVal & DSI_INT_ESCAPE_TX_END)) {
        DSI_IntClear(dsiId, DSI_INT_ESCAPE_TX_END);

        if (DSIIntCbfArra[dsiId][0] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][0]();
        }
    }

    if (tmpVal & DSI_INT_LPDT_RX_END && !(maskVal & DSI_INT_LPDT_RX_END)) {
        DSI_IntClear(dsiId, DSI_INT_LPDT_RX_END);

        if (DSIIntCbfArra[dsiId][1] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][1]();
        }
    }

    if (tmpVal & DSI_INT_ULPS_RX_END && !(maskVal & DSI_INT_ULPS_RX_END)) {
        DSI_IntClear(dsiId, DSI_INT_ULPS_RX_END);

        if (DSIIntCbfArra[dsiId][2] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][2]();
        }
    }

    if (tmpVal & DSI_INT_TRIGGER0_RX_END && !(maskVal & DSI_INT_TRIGGER0_RX_END)) {
        DSI_IntClear(dsiId, DSI_INT_TRIGGER0_RX_END);

        if (DSIIntCbfArra[dsiId][3] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][3]();
        }
    }

    if (tmpVal & DSI_INT_TRIGGER1_RX_END && !(maskVal & DSI_INT_TRIGGER1_RX_END)) {
        DSI_IntClear(dsiId, DSI_INT_TRIGGER1_RX_END);

        if (DSIIntCbfArra[dsiId][4] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][4]();
        }
    }

    if (tmpVal & DSI_INT_TRIGGER2_RX_END && !(maskVal & DSI_INT_TRIGGER2_RX_END)) {
        DSI_IntClear(dsiId, DSI_INT_TRIGGER2_RX_END);

        if (DSIIntCbfArra[dsiId][5] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][5]();
        }
    }

    if (tmpVal & DSI_INT_TRIGGER3_RX_END && !(maskVal & DSI_INT_TRIGGER3_RX_END)) {
        DSI_IntClear(dsiId, DSI_INT_TRIGGER3_RX_END);

        if (DSIIntCbfArra[dsiId][6] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][6]();
        }
    }

    if (tmpVal & DSI_INT_TX_FIFO_READY && !(maskVal & DSI_INT_TX_FIFO_READY)) {
        DSI_IntClear(dsiId, DSI_INT_TX_FIFO_READY);

        if (DSIIntCbfArra[dsiId][7] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][7]();
        }
    }

    if (tmpVal & DSI_INT_RX_FIFO_READY && !(maskVal & DSI_INT_RX_FIFO_READY)) {
        DSI_IntClear(dsiId, DSI_INT_RX_FIFO_READY);

        if (DSIIntCbfArra[dsiId][8] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][8]();
        }
    }

    if (tmpVal & DSI_INT_DATA_OVERRUN_ERR && !(maskVal & DSI_INT_DATA_OVERRUN_ERR)) {
        DSI_IntClear(dsiId, DSI_INT_DATA_OVERRUN_ERR);

        if (DSIIntCbfArra[dsiId][9] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][9]();
        }
    }

    if (tmpVal & DSI_INT_DATA_UNDERRUN_ERR && !(maskVal & DSI_INT_DATA_UNDERRUN_ERR)) {
        DSI_IntClear(dsiId, DSI_INT_DATA_UNDERRUN_ERR);

        if (DSIIntCbfArra[dsiId][10] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][10]();
        }
    }

    if (tmpVal & DSI_INT_PIXEL_COUNT_SMALL_ERR && !(maskVal & DSI_INT_PIXEL_COUNT_SMALL_ERR)) {
        DSI_IntClear(dsiId, DSI_INT_PIXEL_COUNT_SMALL_ERR);

        if (DSIIntCbfArra[dsiId][11] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][11]();
        }
    }

    if (tmpVal & DSI_INT_PIXEL_COUNT_LARGE_ERR && !(maskVal & DSI_INT_PIXEL_COUNT_LARGE_ERR)) {
        DSI_IntClear(dsiId, DSI_INT_PIXEL_COUNT_LARGE_ERR);

        if (DSIIntCbfArra[dsiId][12] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][12]();
        }
    }

    if (tmpVal & DSI_INT_FIFO_ERROR && !(maskVal & DSI_INT_FIFO_ERROR)) {
        DSI_IntClear(dsiId, DSI_INT_FIFO_ERROR);

