RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsi.c
        if (DSIIntCbfArra[dsiId][13] != NULL) {
            /* call the callback function */
            DSIIntCbfArra[dsiId][13]();
        }
    }

    return SUCCESS;
}
#endif

/*@} end of group DSI_Private_Functions */

/** @defgroup  DSI_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  DSI module init
 *
 * @param  dsiId: DSI ID type
 * @param  cfg: DSI configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void DSI_Init(DSI_ID_Type dsiId, DSI_CFG_Type *cfg)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];
    DSI_Lane_Type lanes=0;

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_DATA_TYPE(cfg->dataType));
    CHECK_PARAM(IS_DSI_LANE_NUMBER_TYPE(cfg->laneNum));
    CHECK_PARAM(IS_DSI_LANE_ORDER_TYPE(cfg->laneOrder));
    CHECK_PARAM(IS_DSI_HS_SYNC_TYPE(cfg->syncType));

    /* Set DSI configuration */
    tmpVal = BL_RD_REG(DSIx, DSI_CONFIG);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LANE_NUM, cfg->laneNum);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_HSTX_MODE, cfg->syncType);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LANE_MUX_SEL, cfg->laneOrder);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_DT, cfg->dataType);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_VC, cfg->virtualChan);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_HSTX_VFP, cfg->vfp);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_HSTX_VSA, cfg->vsa);

    BL_WR_REG(DSIx, DSI_CONFIG, tmpVal);

    if(cfg->laneNum == DSI_LANE_NUMBER_1){
        lanes=DSI_LANE_CLOCK|DSI_LANE_DATA0;
    }else if(cfg->laneNum == DSI_LANE_NUMBER_2){
        lanes=DSI_LANE_CLOCK|DSI_LANE_DATA0|DSI_LANE_DATA1;
    }else if(cfg->laneNum == DSI_LANE_NUMBER_4){
        lanes=DSI_LANE_CLOCK|DSI_LANE_DATA0|DSI_LANE_DATA1|DSI_LANE_DATA2|DSI_LANE_DATA3;
    }

    DSI_PHY_Enable_Lanes(dsiId,lanes);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(MIPI_DSI_IRQn, DSI_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  Deinit DSI module
 *
 * @param  dsiId: DSI ID type
 *
 * @return None
 *
*******************************************************************************/
void DSI_Deinit(DSI_ID_Type dsiId)
{
}

/****************************************************************************/ /**
 * @brief  DSI Enable Disable Interrupt
 *
 * @param  dsiId: DSI ID type
 * @param  intType: DSI Interrupt Type
 * @param  intMask: mask or unmask
 *
 * @return None
 *
*******************************************************************************/
void DSI_IntMask(DSI_ID_Type dsiId, DSI_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_INT_TYPE(intType));
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    tmpVal = BL_RD_REG(DSIx, DSI_INT_MASK);

    if (intMask == UNMASK) {
        /* Unmask this interrupt */
        tmpVal &= (~intType);

    } else {
        /* Mask this interrupt */
        tmpVal |= intType;
    }

    BL_WR_REG(DSIx, DSI_INT_MASK, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI Clear Interrupt
 *
 * @param  dsiId: DSI ID type
 * @param  intType: DSI Interrupt Type
 *
 * @return None
 *
*******************************************************************************/
void DSI_IntClear(DSI_ID_Type dsiId, DSI_INT_Type intType)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_INT_TYPE(intType));

    tmpVal = BL_RD_REG(DSIx, DSI_INT_CLEAR);

    /* Clear this interrupt */
    tmpVal |= intType;

    BL_WR_REG(DSIx, DSI_INT_CLEAR, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI Enable Interrupt
 *
 * @param  dsiId: DSI ID type
 * @param  intType: DSI Interrupt Type
 *
 * @return None
 *
*******************************************************************************/
void DSI_IntEnable(DSI_ID_Type dsiId, DSI_INT_Type intType)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_INT_TYPE(intType));

    tmpVal = BL_RD_REG(DSIx, DSI_INT_ENABLE);

    /* Enable this interrupt */
    tmpVal |= intType;

    BL_WR_REG(DSIx, DSI_INT_ENABLE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI Get Interrupt status
 *
 * @param  dsiId: DSI ID type
 *
 * @return None
 *
*******************************************************************************/
DSI_INT_Type DSI_IntGet(DSI_ID_Type dsiId)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    tmpVal = BL_RD_REG(DSIx, DSI_INT_STATUS);

    return BL_GET_REG_BITS_VAL(tmpVal, DSI_INT_STATUS);
}

/****************************************************************************/ /**
 * @brief  DSI set line buffer threshold for controller to start transmitting each line(unit:pixel)
 *
 * @param  dsiId: DSI ID type
 * @param  frameWidth: frame width
 * @param  dvpTsrcClock: display(dp_dvp_tsrc) clock rate
 * @param  dsiClock: DSI bit clock rate
 * @param  dataType: DSI data type
 * @param  laneNumber: DSI lane number
 *
 * @return None
 *
*******************************************************************************/
void DSI_Set_Line_Buffer_Threshold(DSI_ID_Type dsiId, uint32_t frameWidth, uint32_t dvpTsrcClock, uint32_t dsiClock, \
                                   DSI_Data_Type dataType, DSI_Lane_Number_Type laneNumber)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];
    int64_t threshold = dvpTsrcClock;
    uint32_t pixelByte;

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_DATA_TYPE(dataType));
    CHECK_PARAM(IS_DSI_LANE_NUMBER_TYPE(laneNumber));

    /* Frame Width should not exceed 1280 and should be a multiple of 4 */
    if(frameWidth > 1280 || frameWidth % 4){
        return;
    }

    if(dataType < DSI_DATA_RGB666){
        pixelByte = 2;
    }else{
        pixelByte = 3;
    }

