RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsi.c
    threshold = frameWidth - threshold*frameWidth*pixelByte/(dsiClock/8)/(1<<laneNumber);

    if(threshold < 6){
        threshold = 6;
    }
    tmpVal = BL_RD_REG(DSIx, DSI_HSTX_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_HSTX_PC, frameWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_HSTX_OUT_TH, threshold);
    BL_WR_REG(DSIx, DSI_HSTX_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI set VSA and VFP
 *
 * @param  dsiId: DSI ID type
 * @param  vsa: Vertical sync active
 * @param  vfp: Vertical front porch
 *
 * @return None
 *
*******************************************************************************/
void DSI_Set_VSA_VFP(DSI_ID_Type dsiId, uint8_t vsa, uint8_t vfp)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    tmpVal = BL_RD_REG(DSIx, DSI_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_HSTX_VFP, vfp);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_HSTX_VSA, vsa);
    BL_WR_REG(DSIx, DSI_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI Reinit data lanes
 *
 * @param  dsiId: DSI ID type
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_Reset(DSI_ID_Type dsiId)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_0);

    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_RESET_N);
    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);

    tmpVal = BL_SET_REG_BIT(tmpVal, DSI_RESET_N);
    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI Config DPHY
 *
 * @param  dsiId: DSI ID type
 *
 * @param  phyCfg: DPHY config
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_Config(DSI_ID_Type dsiId, DSI_DPhy_CFG_Type *phyCfg)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_CK_ZERO, phyCfg->time_clk_zero);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_CK_TRAIL, phyCfg->time_clk_trail);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_CK_EXIT, phyCfg->time_clk_exit);
    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_1, tmpVal);

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_HS_ZERO, phyCfg->time_data_zero);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_HS_TRAIL, phyCfg->time_data_trail);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_HS_EXIT, phyCfg->time_data_exit);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_HS_PREP, phyCfg->time_data_prepare);
    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_2, tmpVal);

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_TA_GO, phyCfg->time_ta_go);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_TA_GET, phyCfg->time_ta_get);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_REQRDY, phyCfg->time_req_ready);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_LPX, phyCfg->time_lpx);
    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_3, tmpVal);

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_REG_TIME_WAKEUP, phyCfg->time_wakeup);
    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_4, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI Reinit data lanes
 *
 * @param  dsiId: DSI ID type
 *
 * @param  lanes: lanes
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_Reinit_Data_Lanes(DSI_ID_Type dsiId, DSI_Lane_Type lanes)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_LANE_TYPE(lanes));

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_0);

    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL0_FORCERXMODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL1_FORCERXMODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL2_FORCERXMODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL3_FORCERXMODE);
    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);

    if (lanes & DSI_LANE_DATA0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL0_FORCERXMODE);
    }

    if (lanes & DSI_LANE_DATA1) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL1_FORCERXMODE);
    }

    if (lanes & DSI_LANE_DATA2) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL2_FORCERXMODE);
    }

    if (lanes & DSI_LANE_DATA3) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL3_FORCERXMODE);
    }

    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI enable lanes
 *
 * @param  dsiId: DSI ID type
 *
 * @param  lanes: lanes
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_Enable_Lanes(DSI_ID_Type dsiId, DSI_Lane_Type lanes)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_LANE_TYPE(lanes));

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_0);

    if (lanes & DSI_LANE_DATA0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL0_ENABLE);
    }

    if (lanes & DSI_LANE_DATA1) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL1_ENABLE);
    }

    if (lanes & DSI_LANE_DATA2) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL2_ENABLE);
    }

    if (lanes & DSI_LANE_DATA3) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL3_ENABLE);
    }

    if (lanes & DSI_LANE_CLOCK) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_CL_ENABLE);
    }

    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI disable lanes
 *
 * @param  dsiId: DSI ID type
 *
 * @param  lanes: lanes
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_Disable_Lanes(DSI_ID_Type dsiId, DSI_Lane_Type lanes)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_LANE_TYPE(lanes));

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_0);

    if (lanes & DSI_LANE_DATA0) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL0_ENABLE);
    }

