RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsi.c
    if (lanes & DSI_LANE_DATA1) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL1_ENABLE);
    }

    if (lanes & DSI_LANE_DATA2) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL2_ENABLE);
    }

    if (lanes & DSI_LANE_DATA3) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL3_ENABLE);
    }

    if (lanes & DSI_LANE_CLOCK) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_CL_ENABLE);
    }

    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI stop data lanes
 *
 * @param  dsiId: DSI ID type
 *
 * @param  lanes: lanes
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_Stop_Data_Lanes(DSI_ID_Type dsiId, DSI_Lane_Type lanes)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_LANE_TYPE(lanes));

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_0);

    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL0_FORCETXSTOPMODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL1_FORCETXSTOPMODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL2_FORCETXSTOPMODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DL3_FORCETXSTOPMODE);
    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);

    if (lanes & DSI_LANE_DATA0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL0_FORCETXSTOPMODE);
    }

    if (lanes & DSI_LANE_DATA1) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL1_FORCETXSTOPMODE);
    }

    if (lanes & DSI_LANE_DATA2) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL2_FORCETXSTOPMODE);
    }

    if (lanes & DSI_LANE_DATA3) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL3_FORCETXSTOPMODE);
    }

    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI stop data lanes
 *
 * @param  dsiId: DSI ID type
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_Data_Lane0_TurnAround(DSI_ID_Type dsiId)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DL0_TURNESC);
    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DSI get lanes state
 *
 * @param  dsiId: DSI ID type
 *
 * @param  lanes: lanes
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_Get_Lanes_State(DSI_ID_Type dsiId, DSI_Lane_Type lane, DSI_Lane_State_Type *state)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];
    uint32_t stop_state_pos = 0;
    uint32_t ulp_state_pos = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_LANE_TYPE(lanes));

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_0);

    *state = DSI_LANE_STAT_NORMAL;

    if (lane == DSI_LANE_DATA0) {
        stop_state_pos = DSI_DL0_STOPSTATE_POS;
        ulp_state_pos = DSI_DL0_ULPSACTIVENOT_POS;
    } else if (lane == DSI_LANE_DATA1) {
        stop_state_pos = DSI_DL1_STOPSTATE_POS;
        ulp_state_pos = DSI_DL1_ULPSACTIVENOT_POS;
    } else if (lane == DSI_LANE_DATA2) {
        stop_state_pos = DSI_DL2_STOPSTATE_POS;
        ulp_state_pos = DSI_DL2_ULPSACTIVENOT_POS;
    } else if (lane == DSI_LANE_DATA3) {
        stop_state_pos = DSI_DL3_STOPSTATE_POS;
        ulp_state_pos = DSI_DL3_ULPSACTIVENOT_POS;
    } else if (lane == DSI_LANE_CLOCK) {
        stop_state_pos = DSI_CL_STOPSTATE_POS;
        ulp_state_pos = DSI_CL_ULPSACTIVENOT_POS;
    } else {
        return;
    }

    if(!(tmpVal & (1 << ulp_state_pos))) {
        *state = DSI_LANE_STAT_ULP;
    } else if(tmpVal & (1 << stop_state_pos)) {
        *state = DSI_LANE_STAT_STOP;
    } else {
        if(lane == DSI_LANE_CLOCK) {
            if(tmpVal & (1 << DSI_CL_TXREQUESTHS_POS)) {
                *state = DSI_LANE_STAT_HS;
            } else {
                *state = DSI_LANE_STAT_BRIDGE;
            }
        } else {
            if(BL_RD_REG(DSIx, DSI_CONFIG) & (1 << DSI_CR_HSTX_EN_POS)) {
                *state = DSI_LANE_STAT_HS;
            } else {
                *state = DSI_LANE_STAT_BRIDGE;
            }
        }
    }
}

/****************************************************************************/ /**
 * @brief  Set clock lane operation
 *
 * @param  dsiId: DSI ID type
 *
 * @param  opt: operation type
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_Set_Clock_Lane(DSI_ID_Type dsiId, DSI_Clock_Lane_Opt_Type opt)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));
    CHECK_PARAM(IS_DSI_CLOCK_LANE_OPT_TYPE(opt));

    tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_0);

    if (opt & DSI_CLOCK_LANE_OPT_ULP_ENTER) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_CL_TXULPSCLK);
    }

    if (opt & DSI_CLOCK_LANE_OPT_ULP_EXIT) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_CL_TXULPSEXIT);
        BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);
        arch_delay_ms(1);
        tmpVal = BL_RD_REG(DSIx, DSI_DPHY_CONFIG_0);
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_CL_TXULPSCLK);
    }

    if (opt & DSI_CLOCK_LANE_OPT_HS_REQ) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_CL_TXREQUESTHS);
    }

    if (opt & DSI_CLOCK_LANE_OPT_HS_EXIT) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_CL_TXREQUESTHS);
    }

    BL_WR_REG(DSIx, DSI_DPHY_CONFIG_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Start HS Mode
 *
 * @param  dsiId: DSI ID type
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_HS_Mode_Start(DSI_ID_Type dsiId)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];
    DSI_Lane_State_Type state = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    /* bring clock lane to high speed */
    DSI_PHY_Get_Lanes_State(dsiId, DSI_LANE_CLOCK, &state);
    if(state == DSI_LANE_STAT_STOP){
        DSI_PHY_Set_Clock_Lane(dsiId, DSI_CLOCK_LANE_OPT_HS_REQ);
    }

    /* bring data lane to high speed */
    DSI_PHY_Get_Lanes_State(dsiId, DSI_LANE_DATA0, &state);
    if(state == DSI_LANE_STAT_STOP){
        tmpVal = BL_RD_REG(DSIx, DSI_CONFIG);
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_CR_HSTX_EN);
        BL_WR_REG(DSIx, DSI_CONFIG, tmpVal);
    }

