RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsi.c
}

/****************************************************************************/ /**
 * @brief  Stop HS Mode
 *
 * @param  dsiId: DSI ID type
 *
 * @return None
 *
*******************************************************************************/
void DSI_PHY_HS_Mode_Stop(DSI_ID_Type dsiId)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];
    DSI_Lane_State_Type state = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    /* set data lane to stop mode */
    DSI_PHY_Get_Lanes_State(dsiId, DSI_LANE_DATA0, &state);
    if(state != DSI_LANE_STAT_STOP){
        tmpVal = BL_RD_REG(DSIx, DSI_CONFIG);
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_CR_HSTX_EN);
        BL_WR_REG(DSIx, DSI_CONFIG, tmpVal);
        do{
            DSI_PHY_Get_Lanes_State(dsiId, DSI_LANE_DATA0, &state);
        }while(state != DSI_LANE_STAT_STOP);
    }

    /* set clock lane to stop mode */
    DSI_PHY_Get_Lanes_State(dsiId, DSI_LANE_CLOCK, &state);
    if(state != DSI_LANE_STAT_STOP){
        DSI_PHY_Set_Clock_Lane(dsiId, DSI_CLOCK_LANE_OPT_HS_EXIT);
        do{
            DSI_PHY_Get_Lanes_State(dsiId, DSI_LANE_CLOCK, &state);
        }while(state != DSI_LANE_STAT_STOP);
    }

}

/****************************************************************************/ /**
 * @brief  DSI configure fifo function
 *
 * @param  dsiId: DSI ID type
 *
 * @param  fifoCfg: FIFO configuration structure pointer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_FifoConfig(DSI_ID_Type dsiId, DSI_FifoCfg_Type *fifoCfg)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    /* Deal with DSI fifo configure register */
    tmpVal = BL_RD_REG(DSIx, DSI_FIFO_CONFIG_1);
    /* Configure dma tx fifo threshold */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_TX_FIFO_TH, fifoCfg->txFifoDmaThreshold);
    /* Configure dma rx fifo threshold */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_RX_FIFO_TH, fifoCfg->rxFifoDmaThreshold);
    /* Write back */
    BL_WR_REG(DSIx, DSI_FIFO_CONFIG_1, tmpVal);

    /* Enable or disable DSI fifo dma function */
    tmpVal = BL_RD_REG(DSIx, DSI_FIFO_CONFIG_0);

    if (ENABLE == fifoCfg->txFifoDmaEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DMA_TX_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DMA_TX_EN);
    }

    if (ENABLE == fifoCfg->rxFifoDmaEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSI_DMA_RX_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_DMA_RX_EN);
    }

    BL_WR_REG(DSIx, DSI_FIFO_CONFIG_0, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSI start tx for short and long packet
 *
 * @param  dsiId: DSI ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_LPDT_Start_Tx(DSI_ID_Type dsiId)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_CR_ESC_RX_EN);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    tmpVal = BL_SET_REG_BIT(tmpVal, DSI_CR_ESC_TX_EN);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    return SUCCESS;
}

/****************************************************************************//**
 * @brief  DSI wait for send done
 *
 * @param  dsiId: DSI ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_Wait_For_Esc_Tx_Done(DSI_ID_Type dsiId)
{
    DSI_INT_Type intStatus;

    /* wait for Tx finished */
    do{
        intStatus=DSI_IntGet(dsiId);
    }while(!(intStatus&DSI_INT_ESCAPE_TX_END));
    DSI_IntClear(dsiId,DSI_INT_ESCAPE_TX_END);

    return SUCCESS;
}
/****************************************************************************/ /**
 * @brief  DSI start rx for short and long packet
 *
 * @param  dsiId: DSI ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_LPDT_Start_Rx(DSI_ID_Type dsiId)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSI_CR_ESC_RX_EN);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    tmpVal = BL_SET_REG_BIT(tmpVal, DSI_CR_ESC_RX_EN);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSI Get Rx length
 *
 * @param  dsiId: DSI ID type
 *
 * @return RX length
 *
*******************************************************************************/
uint16_t DSI_LPDT_Get_Rx_Length(DSI_ID_Type dsiId)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    return BL_GET_REG_BITS_VAL(tmpVal, DSI_ST_ESC_RX_LEN);
}

/****************************************************************************/ /**
 * @brief  DSI Escape mode send trigger command
 *
 * @param  dsiId: DSI ID type
 *
 * @param  cmd: trigger command
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_Send_Trigger_Command(DSI_ID_Type dsiId, uint8_t cmd)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    DSI_PHY_HS_Mode_Stop(dsiId);

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_ESC_TX_MODE, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_ESC_TX_TRIG, cmd);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSI_CR_ESC_TX_EN);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

