RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsi.c
    return DSI_Wait_For_Esc_Tx_Done(dsiId);
}

/****************************************************************************/ /**
 * @brief  DSI Escape mode send ULPS command
 *
 * @param  dsiId: DSI ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_Send_ULPS_Command(DSI_ID_Type dsiId)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    DSI_PHY_HS_Mode_Stop(dsiId);

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_ESC_TX_MODE, 2);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSI_CR_ESC_TX_EN);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    return DSI_Wait_For_Esc_Tx_Done(dsiId);
}

/****************************************************************************/ /**
 * @brief  DSI exit ULPS
 *
 * @param  dsiId: DSI ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_Exit_ULPS(DSI_ID_Type dsiId)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];
    //DSI_Lane_State_Type state;

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_ESC_TX_ULPS_EXIT, 1);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    arch_delay_ms(2);
#if 0
    DSI_PHY_HS_Mode_Stop(dsiId);

    do
    {
        DSI_PHY_Get_Lanes_State(dsiId, DSI_LANE_DATA0, &state);
    } while(state != DSI_LANE_STAT_STOP);

#endif
    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_ESC_TX_MODE, 3);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSI_CR_ESC_TX_EN);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    return DSI_Wait_For_Esc_Tx_Done(dsiId);
}

/****************************************************************************/ /**
 * @brief  DSI config LPDT short packet
 *
 * @param  dsiId: DSI ID type
 *
 * @param  msg: LPDT long message config
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_LPDT_Config_Short_Packet(DSI_ID_Type dsiId, DSI_LPDT_MSG_Type *msg)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    DSI_PHY_HS_Mode_Stop(dsiId);

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_ESC_TX_MODE, 0);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    /*short packet*/
    tmpVal = BL_RD_REG(DSIx, DSI_LPDT_TX_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LPDT_PDLEN, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LPDT_VC, msg->virtualChan);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LPDT_DI, msg->dataType);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LPDT_WORD0, msg->tx_buf[0]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LPDT_WORD1, msg->tx_buf[1]);
    BL_WR_REG(DSIx, DSI_LPDT_TX_CONFIG, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSI send LPDT short packet
 *
 * @param  dsiId: DSI ID type
 *
 * @param  msg: DSI message config
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_LPDT_Send_Short_Packet(DSI_ID_Type dsiId, DSI_LPDT_MSG_Type *msg)
{
    DSI_LPDT_Config_Short_Packet(dsiId, msg);

    DSI_LPDT_Start_Tx(dsiId);

    return DSI_Wait_For_Esc_Tx_Done(dsiId);
}

/****************************************************************************/ /**
 * @brief  DSI config LPDT long packet
 *
 * @param  dsiId: DSI ID type
 *
 * @param  msg: LPDT long message config
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_LPDT_Config_Long_Packet(DSI_ID_Type dsiId, DSI_LPDT_MSG_Type *msg)
{
    uint32_t tmpVal;
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameters */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    DSI_PHY_HS_Mode_Stop(dsiId);

    tmpVal = BL_RD_REG(DSIx, DSI_ESC_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_ESC_TX_MODE, 0);
    BL_WR_REG(DSIx, DSI_ESC_CONFIG, tmpVal);

    /*long  packet*/
    tmpVal = BL_RD_REG(DSIx, DSI_LPDT_TX_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LPDT_VC, msg->virtualChan);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LPDT_DI, msg->dataType);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LPDT_WORD0, msg->tx_len & 0xff);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LPDT_WORD1, (msg->tx_len >> 8) & 0xff);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSI_CR_LPDT_PDLEN, msg->tx_len);
    BL_WR_REG(DSIx, DSI_LPDT_TX_CONFIG, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSI get tx fifo unoccupied count value
 *
 * @param  dsiId: DSI ID type
 *
 * @return Tx fifo unoccupied count value
 *
*******************************************************************************/
uint8_t DSI_GetTxFifoCount(DSI_ID_Type dsiId)
{
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameter */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    return BL_GET_REG_BITS_VAL(BL_RD_REG(DSIx, DSI_FIFO_CONFIG_1), DSI_TX_FIFO_CNT);
}

/****************************************************************************/ /**
 * @brief  DSI get rx fifo count value
 *
 * @param  dsiId: DSI ID type
 *
 * @return Rx fifo count value
 *
*******************************************************************************/
uint8_t DSI_GetRxFifoCount(DSI_ID_Type dsiId)
{
    uint32_t DSIx = dsiAddr[dsiId];

    /* Check the parameter */
    CHECK_PARAM(IS_DSI_ID_TYPE(dsiId));

    return BL_GET_REG_BITS_VAL(BL_RD_REG(DSIx, DSI_FIFO_CONFIG_1), DSI_RX_FIFO_CNT);
}

/****************************************************************************/ /**
 * @brief  DSI full fill FIFO
 *
 * @param  dsiId: DSI ID type
 *
 * @param  data: Data to send buffer
 *
 * @param  len: Data length to send
 *
 * @return Data length filled
 *
*******************************************************************************/
uint8_t DSI_Full_Fill_FIFO(DSI_ID_Type dsiId, const uint8_t *data, uint16_t len)
{
    uint32_t DSIx = dsiAddr[dsiId];
    const uint8_t *pDataEnd = data + len;
    uint8_t filled = 0;

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

