RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsi.c
    /* Send data */
    while (data < pDataEnd) {
        if (DSI_GetTxFifoCount(dsiId) > 0) {
            BL_WR_WORD(DSIx + DSI_FIFO_WDATA_OFFSET, BL_RDWD_FRM_BYTEP(data));
            data += 4;
            filled += 4;
        } else {
            return filled;
        }
    }

    return filled;
}

/****************************************************************************/ /**
 * @brief  DSI feed FIFO with data
 *
 * @param  dsiId: DSI ID type
 *
 * @param  data: Data to send buffer
 *
 * @param  len: Data length to send
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_Feed_FIFO(DSI_ID_Type dsiId, const uint8_t *data, uint16_t len)
{
    uint32_t timeoutCnt = DSI_TX_TIMEOUT_COUNT;
    uint32_t DSIx = dsiAddr[dsiId];
    const uint8_t *pDataEnd = data + len;

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Send data */
    while (data < pDataEnd) {
        if (DSI_GetTxFifoCount(dsiId) > 0) {
            BL_WR_WORD(DSIx + DSI_FIFO_WDATA_OFFSET, BL_RDWD_FRM_BYTEP(data));
            timeoutCnt = DSI_TX_TIMEOUT_COUNT;
            data += 4;
        } else {
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return TIMEOUT;
            }
        }
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSI Read FIFO
 *
 * @param  dsiId: DSI ID type
 *
 * @param  data: Data to receive buffer
 *
 * @param  len: Data length to receive
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_Read_FIFO(DSI_ID_Type dsiId, uint8_t *data, uint16_t len)
{
    uint32_t DSIx = dsiAddr[dsiId];
    uint8_t *pDataEnd = data + len;

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Receive data */
    while (data < pDataEnd && DSI_GetRxFifoCount(dsiId) > 0) {
        BL_WRWD_TO_BYTEP(data, BL_RD_WORD(DSIx + DSI_FIFO_RDATA_OFFSET));
        data += 4;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSI send LPDT long packet
 *
 * @param  dsiId: DSI ID type
 *
 * @param  msg: DSI message config
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_LPDT_Send_Long_Packet(DSI_ID_Type dsiId, DSI_LPDT_MSG_Type *msg)
{
    uint8_t filled = 0;

    DSI_LPDT_Config_Long_Packet(dsiId, msg);

    filled = DSI_Full_Fill_FIFO(dsiId, msg->tx_buf, msg->tx_len);

    DSI_LPDT_Start_Tx(dsiId);

    if (filled < msg->tx_len) {
        DSI_Feed_FIFO(dsiId, msg->tx_buf + filled, msg->tx_len - filled);
    }

    return DSI_Wait_For_Esc_Tx_Done(dsiId);
}

/****************************************************************************/ /**
 * @brief  DSI receive packet
 *
 * @param  dsiId: DSI ID type
 *
 * @param  msg: DSI message config
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DSI_LPDT_Recv_Packet(DSI_ID_Type dsiId, DSI_LPDT_MSG_Type *msg)
{
    DSI_Lane_State_Type state;
    DSI_INT_Type intStatus;

    /* wait for bus stop */
    do {
        DSI_PHY_Get_Lanes_State(dsiId, DSI_LANE_DATA0, &state);
    } while (state != DSI_LANE_STAT_STOP);

    /* turn around */
    DSI_PHY_Data_Lane0_TurnAround(dsiId);

    /* start rx */
    DSI_LPDT_Start_Rx(dsiId);

    /* wait for rx finished */
    do {
        intStatus = DSI_IntGet(dsiId);
    } while (!(intStatus & DSI_INT_LPDT_RX_END));
    DSI_IntClear(dsiId,DSI_INT_LPDT_RX_END);

    msg->rx_len = DSI_LPDT_Get_Rx_Length(dsiId);

    DSI_Read_FIFO(dsiId, msg->rx_buf, msg->rx_len);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSI interrupt function
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DSI_IRQHandler(void)
{
    DSI_IntHandler(DSI0_ID);
}
#endif

/*@} end of group DSI_Public_Functions */

/*@} end of group DSI */

/*@} end of group BL808_Peripheral_Driver */
